// mark10als
#include <string.h>
// mark10als
#include "CommRoutine.h"
#include <strsafe.h>
#include <map>
using namespace std;

char HiraTable[][3]={
	"Çü","Ç†","Ç°","Ç¢","Ç£","Ç§","Ç•",
	"Ç¶","Çß","Ç®","Ç©","Ç™","Ç´","Ç¨","Ç≠",
	"ÇÆ","ÇØ","Ç∞","Ç±","Ç≤","Ç≥","Ç¥","Çµ",
	"Ç∂","Ç∑","Ç∏","Çπ","Ç∫","Çª","Çº","ÇΩ",
	"Çæ","Çø","Ç¿","Ç¡","Ç¬","Ç√","Çƒ","Ç≈",
	"Ç∆","Ç«","Ç»","Ç…","Ç ","ÇÀ","ÇÃ","ÇÕ",
	"ÇŒ","Çœ","Ç–","Ç—","Ç“","Ç”","Ç‘","Ç’",
	"Ç÷","Ç◊","Çÿ","ÇŸ","Ç⁄","Ç€","Ç‹","Ç›",
	"Çﬁ","Çﬂ","Ç‡","Ç·","Ç‚","Ç„","Ç‰","ÇÂ",
	"ÇÊ","ÇÁ","ÇË","ÇÈ","ÇÍ","ÇÎ","ÇÏ","ÇÌ",
	"ÇÓ","ÇÔ","Ç","ÇÒ","Å@","Å@","Å@","ÅT",
	"ÅU","Å[","ÅB","Åu","Åv","ÅA","ÅE",
	"ÅI","Åh","Åî","Åê","Åì","Åï","Åf",
	"Åi","Åj","Åñ","Å{","ÅC","Å|","ÅD","Å^",
	"ÇO","ÇP","ÇQ","ÇR","ÇS","ÇT","ÇU","ÇV",
	"ÇW","ÇX","ÅF","ÅG","ÅÉ","ÅÅ","ÅÑ","ÅH",
	"Åó","Ç`","Ça","Çb","Çc","Çd","Çe","Çf",
	"Çg","Çh","Çi","Çj","Çk","Çl","Çm","Çn",
	"Ço","Çp","Çq","Çr","Çs","Çt","Çu","Çv",
	"Çw","Çx","Çy","Åm","Åè","Ån","ÅO","ÅQ",
	"Åe","ÇÅ","ÇÇ","ÇÉ","ÇÑ","ÇÖ","ÇÜ","Çá",
	"Çà","Çâ","Çä","Çã","Çå","Çç","Çé","Çè",
	"Çê","Çë","Çí","Çì","Çî","Çï","Çñ","Çó",
	"Çò","Çô","Çö","Åo","Åb","Åp","ÅP"
};

char HalfHiraTable[][3]={
	"Çü","Ç†","Ç°","Ç¢","Ç£","Ç§","Ç•",
	"Ç¶","Çß","Ç®","Ç©","Ç™","Ç´","Ç¨","Ç≠",
	"ÇÆ","ÇØ","Ç∞","Ç±","Ç≤","Ç≥","Ç¥","Çµ",
	"Ç∂","Ç∑","Ç∏","Çπ","Ç∫","Çª","Çº","ÇΩ",
	"Çæ","Çø","Ç¿","Ç¡","Ç¬","Ç√","Çƒ","Ç≈",
	"Ç∆","Ç«","Ç»","Ç…","Ç ","ÇÀ","ÇÃ","ÇÕ",
	"ÇŒ","Çœ","Ç–","Ç—","Ç“","Ç”","Ç‘","Ç’",
	"Ç÷","Ç◊","Çÿ","ÇŸ","Ç⁄","Ç€","Ç‹","Ç›",
	"Çﬁ","Çﬂ","Ç‡","Ç·","Ç‚","Ç„","Ç‰","ÇÂ",
	"ÇÊ","ÇÁ","ÇË","ÇÈ","ÇÍ","ÇÎ","ÇÏ","ÇÌ",
	"ÇÓ","ÇÔ","Ç","ÇÒ"," "," "," ","ÅT",
	"ÅU","∞","°","¢","£","§","•",
	"!","\"","#","$","%","&","'",
	"(",")","*","+",",","-",".","/",
	"0","1","2","3","4","5","6","7",
	"8","9",":",";","<","=",">","?",
	"@","A","B","C","D","E","F","G",
	"H","I","J","K","L","M","N","O",
	"P","Q","R","S","T","U","V","W",
	"X","Y","Z","[","Åè","]","^","_",
	"`","a","b","c","d","e","f","g",
	"h","i","j","k","l","m","n","o",
	"p","q","r","s","t","u","v","w",
	"x","y","z","{","|","}","ÅP"
};

char KanaTable[][3]={
	"É@","ÉA","ÉB","ÉC","ÉD","ÉE","ÉF",
	"ÉG","ÉH","ÉI","ÉJ","ÉK","ÉL","ÉM","ÉN",
	"ÉO","ÉP","ÉQ","ÉR","ÉS","ÉT","ÉU","ÉV",
	"ÉW","ÉX","ÉY","ÉZ","É[","É\","É]","É^",
	"É_","É`","Éa","Éb","Éc","Éd","Ée","Éf",
	"Ég","Éh","Éi","Éj","Ék","Él","Ém","Én",
	"Éo","Ép","Éq","Ér","És","Ét","Éu","Év",
	"Éw","Éx","Éy","Éz","É{","É|","É}","É~",
	"ÉÄ","ÉÅ","ÉÇ","ÉÉ","ÉÑ","ÉÖ","ÉÜ","Éá",
	"Éà","Éâ","Éä","Éã","Éå","Éç","Éé","Éè",
	"Éê","Éë","Éí","Éì","Éî","Éï","Éñ","ÅR",
	"ÅS","Å[","ÅB","Åu","Åv","ÅA","ÅE"
};

char HalfKanaTable[][3]={
	"ß","±","®","≤","©","≥","™",
	"¥","´","µ","∂","∂ﬁ","∑","∑ﬁ","∏",
	"∏ﬁ","π","πﬁ","∫","∫ﬁ","ª","ªﬁ","º",
	"ºﬁ","Ω","Ωﬁ","æ","æﬁ","ø","øﬁ","¿",
	"¿ﬁ","¡","¡ﬁ","Ø","¬","¬ﬁ","√","√ﬁ",
	"ƒ","ƒﬁ","≈","∆","«","»","…"," ",
	" ﬁ"," ﬂ","À","Àﬁ","Àﬂ","Ã","Ãﬁ","Ãﬂ",
	"Õ","Õﬁ","Õﬂ","Œ","Œﬁ","Œﬂ","œ","–",
	"—","“","”","¨","‘","≠","’","Æ",
	"÷","◊","ÿ","Ÿ","⁄","€","Éé","‹",
	"Éê","Éë","¶","›","≥ﬁ","Éï","Éñ","ÅR",
	"ÅS","∞","°","¢","£","§","•"
};

#ifdef _DEBUG
VOID
DbgString(
	IN	LPCTSTR tracemsg,
	...
	)
{
	TCHAR buf[MAX_DEBUG_OUTPUT_LENGTH] = {0};
	HRESULT ret;

	__try {
		va_list ptr;
		va_start(ptr,tracemsg);

		ret = StringCchVPrintf(
			buf,
			2048,
			tracemsg,
			ptr
			);

		if(ret == S_OK) {
			OutputDebugString(buf);
		}
	}
	__finally {
	}

	return;
}
#endif

std::string GetHalfChar(std::string key)
{
//	std::string ret;
	CHAR ret[1024] = {0};
	BOOL bMatch = FALSE;
// mark10als
	// É}ÉbÉ`ÇµÇ»Ç¢ï∂éöÇÕÅAÇªÇÃÇ‹Ç‹égóp
	const char * _p = key.c_str();
//	const char * _pret = ret.c_str();
	char * p = (char *)key.c_str();
//	char * pret = (char *)ret.c_str();

	for(; p < _p + key.size();) {
		for(int i = 0; i < sizeof(HiraTable)/sizeof(HiraTable[0]) && p < _p + key.size(); i++) {
			bMatch = FALSE;
			if(memcmp(p, HiraTable[i], 2) == 0) {
//				ret += HalfHiraTable[i];
				strcat_s( ret, 1024, HalfHiraTable[i] );
				p+=2;
				bMatch = TRUE;
				i = -1;
			}
		}

		for(int i = 0; i < sizeof(KanaTable)/sizeof(KanaTable[0]) && p < _p + key.size(); i++) {
			bMatch = FALSE;
			if(memcmp(p, KanaTable[i], 2) == 0) {
//				ret += HalfKanaTable[i];
				strcat_s( ret, 1024, HalfKanaTable[i] );
				p+=2;
				bMatch = TRUE;
				i = -1;
			}
		}

		if( p < _p + key.size() ) {
//			ret += strndup(p, 2);
			strncat_s( ret, 1024, p, 2 );
			p+=2;
		}
	}
// mark10als
	return ret;
}

